Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc.h
#define __HAL_RCC_TIM6_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM7_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM12_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM12EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM12EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM13_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM13EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM13EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __HAL_RCC_TIM14_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM14EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM14EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM18_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM18EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM18EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_WWDG_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_WWDGEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_WWDGEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_SPI2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __HAL_RCC_SPI3_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __HAL_RCC_USART2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __HAL_RCC_USART3_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_UART1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_UART2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART2EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
                                      
#define __HAL_RCC_I2C1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_I2C2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_UART3_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART3EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U) 

#define __HAL_RCC_CAN1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CAN1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CAN1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)  
#define __HAL_RCC_CAN2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CAN2EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CAN2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_BKP_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_BKPEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_BKPEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_PWR_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_PWREN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_PWREN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_DAC_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_DACEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_DACEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

                                      
                                      
#define __HAL_RCC_I2C3_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __HAL_RCC_CTC_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CTCEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CTCEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
                                      

#define __HAL_RCC_TIM2_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM2EN))
#define __HAL_RCC_TIM3_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM3EN))
#define __HAL_RCC_TIM4_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM4EN))
#define __HAL_RCC_TIM5_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM5EN))
#define __HAL_RCC_TIM6_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM6EN))
#define __HAL_RCC_TIM7_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM7EN))
#define __HAL_RCC_TIM12_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM12EN))
#define __HAL_RCC_TIM13_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM13EN))
#define __HAL_RCC_TIM14_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM14EN))
#define __HAL_RCC_TIM18_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_TIM18EN))
#define __HAL_RCC_WWDG_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_WWDGEN))
#define __HAL_RCC_SPI2_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_SPI2EN))
#define __HAL_RCC_SPI3_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_SPI3EN))
#define __HAL_RCC_USART2_CLK_DISABLE()    (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_USART2EN))
#define __HAL_RCC_USART3_CLK_DISABLE()    (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_USART3EN))
#define __HAL_RCC_UART1_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_UART1EN))
#define __HAL_RCC_UART2_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_UART2EN))
#define __HAL_RCC_I2C1_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_I2C1EN))
#define __HAL_RCC_I2C2_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_I2C2EN))
#define __HAL_RCC_UART3_CLK_DISABLE()     (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_UART3EN))
#define __HAL_RCC_CAN1_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_CAN1EN))
#define __HAL_RCC_CAN2_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_CAN2EN))
#define __HAL_RCC_BKP_CLK_DISABLE()       (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_BKPEN))
#define __HAL_RCC_PWR_CLK_DISABLE()       (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_PWREN))
#define __HAL_RCC_DAC_CLK_DISABLE()       (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_DACEN))
#define __HAL_RCC_I2C3_CLK_DISABLE()      (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_I2C3EN))
#define __HAL_RCC_CTC_CLK_DISABLE()       (RCC->APB1ENR1 &= ~(RCC_APB1ENR1_CTCEN))
/**
  * @}
  */

