Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc.h
/** @defgroup RCC_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM2_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM2EN)) != RESET)
#define __HAL_RCC_TIM2_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM2EN)) == RESET)
#define __HAL_RCC_TIM3_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM3EN)) != RESET)
#define __HAL_RCC_TIM3_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM3EN)) == RESET)
#define __HAL_RCC_TIM4_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM4EN)) != RESET)
#define __HAL_RCC_TIM4_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM4EN)) == RESET)
#define __HAL_RCC_TIM5_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM5EN)) != RESET)
#define __HAL_RCC_TIM5_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM5EN)) == RESET)
#define __HAL_RCC_TIM6_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM6EN)) != RESET)
#define __HAL_RCC_TIM6_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM6EN)) == RESET)
#define __HAL_RCC_TIM7_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM7EN)) != RESET)
#define __HAL_RCC_TIM7_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM7EN)) == RESET)
#define __HAL_RCC_TIM12_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM12EN)) != RESET)
#define __HAL_RCC_TIM12_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM12EN)) == RESET)
#define __HAL_RCC_TIM13_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM13EN)) != RESET)
#define __HAL_RCC_TIM13_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM13EN)) == RESET)
#define __HAL_RCC_TIM14_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM14EN)) != RESET)
#define __HAL_RCC_TIM14_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM14EN)) == RESET)
#define __HAL_RCC_TIM18_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM18EN)) != RESET)
#define __HAL_RCC_TIM18_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_TIM18EN)) == RESET)
#define __HAL_RCC_WWDG_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_WWDGEN)) != RESET)
#define __HAL_RCC_WWDG_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_WWDGEN)) == RESET)
#define __HAL_RCC_SPI2_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_SPI2EN)) != RESET)
#define __HAL_RCC_SPI2_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_SPI2EN)) == RESET)
#define __HAL_RCC_SPI3_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_SPI3EN)) != RESET)
#define __HAL_RCC_SPI3_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_SPI3EN)) == RESET)
#define __HAL_RCC_USART2_IS_CLK_ENABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_USART2EN)) != RESET)
#define __HAL_RCC_USART2_IS_CLK_DISABLED()    ((RCC->APB1ENR1 & (RCC_APB1ENR1_USART2EN)) == RESET)
#define __HAL_RCC_USART3_IS_CLK_ENABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_USART3EN)) != RESET)
#define __HAL_RCC_USART3_IS_CLK_DISABLED()    ((RCC->APB1ENR1 & (RCC_APB1ENR1_USART3EN)) == RESET)
#define __HAL_RCC_UART1_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART1EN)) != RESET)
#define __HAL_RCC_UART1_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART1EN)) == RESET)
#define __HAL_RCC_UART2_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART2EN)) != RESET)
#define __HAL_RCC_UART2_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART2EN)) == RESET)
#define __HAL_RCC_I2C1_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C1EN)) != RESET)
#define __HAL_RCC_I2C1_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C1EN)) == RESET)
#define __HAL_RCC_I2C2_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C2EN)) != RESET)
#define __HAL_RCC_I2C2_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C2EN)) == RESET)
#define __HAL_RCC_UART3_IS_CLK_ENABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART3EN)) != RESET)
#define __HAL_RCC_UART3_IS_CLK_DISABLED()     ((RCC->APB1ENR1 & (RCC_APB1ENR1_UART3EN)) == RESET)
#define __HAL_RCC_CAN1_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_CAN1EN)) != RESET)
#define __HAL_RCC_CAN1_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_CAN1EN)) == RESET)
#define __HAL_RCC_CAN2_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_CAN2EN)) != RESET)
#define __HAL_RCC_CAN2_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_CAN2EN)) == RESET)
#define __HAL_RCC_BKP_IS_CLK_ENABLED()        ((RCC->APB1ENR1 & (RCC_APB1ENR1_BKPEN)) != RESET)
#define __HAL_RCC_BKP_IS_CLK_DISABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_BKPEN)) == RESET)
#define __HAL_RCC_PWR_IS_CLK_ENABLED()        ((RCC->APB1ENR1 & (RCC_APB1ENR1_PWREN)) != RESET)
#define __HAL_RCC_PWR_IS_CLK_DISABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_PWREN)) == RESET)
#define __HAL_RCC_DAC_IS_CLK_ENABLED()        ((RCC->APB1ENR1 & (RCC_APB1ENR1_DACEN)) != RESET)
#define __HAL_RCC_DAC_IS_CLK_DISABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_DACEN)) == RESET)
#define __HAL_RCC_I2C3_IS_CLK_ENABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C3EN)) != RESET)
#define __HAL_RCC_I2C3_IS_CLK_DISABLED()      ((RCC->APB1ENR1 & (RCC_APB1ENR1_I2C3EN)) == RESET)
#define __HAL_RCC_CTC_IS_CLK_ENABLED()        ((RCC->APB1ENR1 & (RCC_APB1ENR1_CTCEN)) != RESET)
#define __HAL_RCC_CTC_IS_CLK_DISABLED()       ((RCC->APB1ENR1 & (RCC_APB1ENR1_CTCEN)) == RESET)

#define __HAL_RCC_LPTIM1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LPUART1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPUART1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPUART1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_I2C4_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LPTIM1_CLK_DISABLE()       (RCC->APB1ENR2 &= ~(RCC_APB1ENR2_LPTIM1EN))
#define __HAL_RCC_LPUART1_CLK_DISABLE()      (RCC->APB1ENR2 &= ~(RCC_APB1ENR2_LPUART1EN))
#define __HAL_RCC_I2C4_CLK_DISABLE()         (RCC->APB1ENR2 &= ~(RCC_APB1ENR2_I2C4EN))

#define __HAL_RCC_LPTIM1_IS_CLK_ENABLED()    ((RCC->APB1ENR2 & (RCC_APB1ENR2_LPTIM1EN)) != RESET)
#define __HAL_RCC_LPTIM1_IS_CLK_DISABLED()   ((RCC->APB1ENR2 & (RCC_APB1ENR2_LPTIM1EN)) == RESET)
#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()   ((RCC->APB1ENR2 & (RCC_APB1ENR2_LPUART1EN)) != RESET)
#define __HAL_RCC_LPUART1_IS_CLK_DISABLED()  ((RCC->APB1ENR2 & (RCC_APB1ENR2_LPUART1EN)) == RESET)
#define __HAL_RCC_I2C4_IS_CLK_ENABLED()      ((RCC->APB1ENR2 & (RCC_APB1ENR2_I2C4EN)) != RESET)
#define __HAL_RCC_I2C4_IS_CLK_DISABLED()     ((RCC->APB1ENR2 & (RCC_APB1ENR2_I2C4EN)) == RESET)                                      
/**
  * @}
  */

