Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc.h
/** @defgroup RCC_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB1_1_FORCE_RESET()       (RCC->APB1RSTR1 = 0xFFFFFFFFU)
#define __HAL_RCC_TIM2_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM2RST))
#define __HAL_RCC_TIM3_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM3RST))
#define __HAL_RCC_TIM4_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM4RST))
#define __HAL_RCC_TIM5_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM5RST))
#define __HAL_RCC_TIM6_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM6RST))
#define __HAL_RCC_TIM7_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM7RST))
#define __HAL_RCC_TIM12_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM12RST))
#define __HAL_RCC_TIM13_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM13RST))
#define __HAL_RCC_TIM14_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM14RST))
#define __HAL_RCC_TIM18_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_TIM18RST))
#define __HAL_RCC_WWDG_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_WWDGRST))
#define __HAL_RCC_SPI2_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_SPI2RST))
#define __HAL_RCC_SPI3_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_SPI3RST))
#define __HAL_RCC_USART2_FORCE_RESET()       (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_USART2RST))
#define __HAL_RCC_USART3_FORCE_RESET()       (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_USART3RST))
#define __HAL_RCC_UART1_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_UART1RST))
#define __HAL_RCC_UART2_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_UART2RST))
#define __HAL_RCC_I2C1_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_I2C1RST))
#define __HAL_RCC_I2C2_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_I2C2RST))
#define __HAL_RCC_UART3_FORCE_RESET()        (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_UART3RST))
#define __HAL_RCC_CAN1_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_CAN1RST))
#define __HAL_RCC_CAN2_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_CAN2RST))
#define __HAL_RCC_PWR_FORCE_RESET()          (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_PWRRST))
#define __HAL_RCC_DAC_FORCE_RESET()          (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_DACRST))
#define __HAL_RCC_I2C3_FORCE_RESET()         (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_I2C3RST))
#define __HAL_RCC_CTC_FORCE_RESET()          (RCC->APB1RSTR1 |= (RCC_APB1RSTR1_CTCRST))

#define __HAL_RCC_APB1_1_RELEASE_RESET()     (RCC->APB1RSTR1 = 0x00)
#define __HAL_RCC_TIM2_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM2RST))
#define __HAL_RCC_TIM3_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM3RST))
#define __HAL_RCC_TIM4_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM4RST))
#define __HAL_RCC_TIM5_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM5RST))
#define __HAL_RCC_TIM6_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM6RST))
#define __HAL_RCC_TIM7_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM7RST))
#define __HAL_RCC_TIM12_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM12RST))
#define __HAL_RCC_TIM13_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM13RST))
#define __HAL_RCC_TIM14_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM14RST))
#define __HAL_RCC_TIM18_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_TIM18RST))
#define __HAL_RCC_WWDG_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_WWDGRST))
#define __HAL_RCC_SPI2_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_SPI2RST))
#define __HAL_RCC_SPI3_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_SPI3RST))
#define __HAL_RCC_USART2_RELEASE_RESET()     (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_USART2RST))
#define __HAL_RCC_USART3_RELEASE_RESET()     (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_USART3RST))
#define __HAL_RCC_UART1_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_UART1RST))
#define __HAL_RCC_UART2_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_UART2RST))
#define __HAL_RCC_I2C1_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_I2C1RST))
#define __HAL_RCC_I2C2_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_I2C2RST))
#define __HAL_RCC_UART3_RELEASE_RESET()      (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_UART3RST))
#define __HAL_RCC_CAN1_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_CAN1RST))
#define __HAL_RCC_CAN2_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_CAN2RST))
#define __HAL_RCC_PWR_RELEASE_RESET()        (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_PWRRST))
#define __HAL_RCC_DAC_RELEASE_RESET()        (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_DACRST))
#define __HAL_RCC_I2C3_RELEASE_RESET()       (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_I2C3RST))
#define __HAL_RCC_CTC_RELEASE_RESET()        (RCC->APB1RSTR1 &= ~(RCC_APB1RSTR1_CTCRST))

#define __HAL_RCC_APB1_2_FORCE_RESET()       (RCC->APB1RSTR2 = 0xFFFFFFFFU)
#define __HAL_RCC_LPTIM1_FORCE_RESET()       (RCC->APB1RSTR2 |= (RCC_APB1RSTR2_LPTIM1RST))
#define __HAL_RCC_LPUART1_FORCE_RESET()      (RCC->APB1RSTR2 |= (RCC_APB1RSTR2_LPUART1RST))
#define __HAL_RCC_I2C4_FORCE_RESET()         (RCC->APB1RSTR2 |= (RCC_APB1RSTR2_I2C4RST))

#define __HAL_RCC_APB1_2_RELEASE_RESET()     (RCC->APB1RSTR2 = 0x00)
#define __HAL_RCC_LPTIM1_RELEASE_RESET()     (RCC->APB1RSTR2 &= ~(RCC_APB1RSTR2_LPTIM1RST))
#define __HAL_RCC_LPUART1_RELEASE_RESET()    (RCC->APB1RSTR2 &= ~(RCC_APB1RSTR2_LPUART1RST))
#define __HAL_RCC_I2C4_RELEASE_RESET()       (RCC->APB1RSTR2 &= ~(RCC_APB1RSTR2_I2C4RST))
/**
  * @}
  */

/** @defgroup RCC_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB2_FORCE_RESET()         (RCC->APB2RSTR = 0xFFFFFFFFU)
#define __HAL_RCC_SYSCFG_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_SYSCFGRST))
#define __HAL_RCC_ADC1_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_ADC1RST))
#define __HAL_RCC_ADC2_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_ADC2RST))
#define __HAL_RCC_TIM1_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM1RST))
#define __HAL_RCC_SPI1_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_SPI1RST))
#define __HAL_RCC_TIM8_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM8RST))
#define __HAL_RCC_USART1_FORCE_RESET()       (RCC->APB2RSTR |= (RCC_APB2RSTR_USART1RST))
#define __HAL_RCC_ADC3_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_ADC3RST))
#define __HAL_RCC_TIM9_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM9RST))
#define __HAL_RCC_TIM10_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM10RST))
#define __HAL_RCC_TIM11_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM11RST))
#define __HAL_RCC_TIM15_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM15RST))
#define __HAL_RCC_TIM16_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM16RST))
#define __HAL_RCC_TIM17_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM17RST))
#define __HAL_RCC_TIM19_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_TIM19RST))
#define __HAL_RCC_RNG_FORCE_RESET()          (RCC->APB2RSTR |= (RCC_APB2RSTR_RNGRST))
#define __HAL_RCC_COMP_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_COMPRST))
#define __HAL_RCC_OPA_FORCE_RESET()        (RCC->APB2RSTR |= (RCC_APB2RSTR_OPARST))
#define __HAL_RCC_LCDC_FORCE_RESET()         (RCC->APB2RSTR |= (RCC_APB2RSTR_LCDCRST))

#define __HAL_RCC_APB2_RELEASE_RESET()       (RCC->APB2RSTR = 0x00)
#define __HAL_RCC_SYSCFG_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_SYSCFGRST))
#define __HAL_RCC_ADC1_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_ADC1RST))
#define __HAL_RCC_ADC2_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_ADC2RST))
#define __HAL_RCC_TIM1_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM1RST))
#define __HAL_RCC_SPI1_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_SPI1RST))
#define __HAL_RCC_TIM8_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM8RST))
#define __HAL_RCC_USART1_RELEASE_RESET()     (RCC->APB2RSTR &= ~(RCC_APB2RSTR_USART1RST))
#define __HAL_RCC_ADC3_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_ADC3RST))
#define __HAL_RCC_TIM9_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM9RST))
#define __HAL_RCC_TIM10_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM10RST))
#define __HAL_RCC_TIM11_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM11RST))
#define __HAL_RCC_TIM15_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM15RST))
#define __HAL_RCC_TIM16_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM16RST))
#define __HAL_RCC_TIM17_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM17RST))
#define __HAL_RCC_TIM19_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM19RST))
#define __HAL_RCC_RNG_RELEASE_RESET()        (RCC->APB2RSTR &= ~(RCC_APB2RSTR_RNGRST))
#define __HAL_RCC_COMP_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_COMPRST))
#define __HAL_RCC_OPA_RELEASE_RESET()      (RCC->APB2RSTR &= ~(RCC_APB2RSTR_OPARST))
#define __HAL_RCC_LCDC_RELEASE_RESET()       (RCC->APB2RSTR &= ~(RCC_APB2RSTR_LCDCRST))
/**
  * @}
  */

